IDENTIFICATION DIVISION.
PROGRAM-ID. ARRORRECORD.
DATA DIVISION.
01 ARR1.
    02 A OCCURS 3 TIMES.
    03 A1 OCCURS 3 TIMES.
    05 TEMP PIC  99.
01 I PIC 9.
01 J PIC 9.

PROCEDURE DIVISION.
    BEGIN.
        PERFORM VARYING I FROM 1 BY 1 UNTIL I>3
            PERFORM VARYING J FROM 1 BY 1 UNTIL J>3
                ACCEPT TEMP (I,J)
            END-PERFORM
        END-PERFORM.
        PERFORM VARYING I FROM 1 BY 1 UNTIL I>3
            PERFORM VARYING J FROM 1 BY 1 UNTIL J>3
                DISPLAY TEMP (I,J) WITH NO ADVANCING
            END-PERFORM
            DISPLAY " "
        END-PERFORM.
    STOP RUN
END PROGRAM ARRORRECORD.
